from lib import deco
from emoji import emojize
from time import sleep
import logging
from entries.mainmenu import mainmenu
logger = logging.getLogger(__name__)

@deco.run_async
@deco.global_callback_handler(pattern='^cb_privacy$')
def privacy(update, context):
    chat_id = update.effective_chat.id
    query = update.callback_query
    data = query.data
    if data == "cb_privacy":
        message = emojize("מדיניות הפרטיות:\n\n" \
                "\"בוט 2\" הינו בוט חינמי שפותח בעבור כל אחד ואחת באופן פתוח וחופשי בטלאגרם וזאת על מנת לספק שרות עבור כל אחד ואחת שירצו לפרסם כל מוצר למכירה או מסירה.\n\n" \
                "המידע המפורסם במודעה הינה על אחריות המפרסם ותפקידו לנהל את המודעות שלו ולדאוג לתקשורת ישירה מול הרוכש. אין אנו אחראים למפורסם ו\או לכל עניין שבין המוכר לקונה. אנו רק מספקים פלטפורמה ודואגים לתפעולה.\n\n" \
                "אנו נעשה את כל המאמצים לוודא שרק מודעות שיעמדו בכללי המערכת יפורסמו למאגר החיפוש. במידה ונתקלתם במודעה עם תוכן פוגעני עבורכם וברצונכם להתלונן על כך, תוכלו לעשות זאת בקבוצת התמיכה.\n\n" \
                "לכל מודעה שתפורסם יצורף קישור להתקשרות ישירה עם המפרסם. בדרך זו תוכלו להתקשר בצאט ישיר אל המוכר\קונה ולסגור את פרטי העסקה ביניכם. אין אנו אחראים להסרת מודעות לאחר גמר המכירה, אנו מבקשים מכם לוודא שהסרתם את המודעה שלם בעזרת הפקודה המיועדת לכך בסיום העסקה.\n\n" \
                "מעבר לפרסום שם המשתמש של המפרסם בטלאגרם אין אנו מפרסמים שום מידע אחר ואת קוד המודעה שהינו פרטי לכל מודעה עליכם לשמור למעקב וניהול. עניין זה באחריותכם בלבד.\n\n" \
                "כמו כן כל מידע אחר כמו מספרי טלפון וכתובות לאספקה ומשלוח הינו על אחריות המפרסם בלבד ואין מידע זה מפורסם על ידינו כלל. אנו תמיד ממליצים לשמור על בטיחות ברשת ולא לחשוף פרטים מעבר לנדרש.\n\n" \
                "אנו נשתדל לעשות כל שביכולתינו לעמוד לרשותכם ולעזור לכם למצוא את מבוקשכם. מכיוון שזו מערכת חדשה יתכנו באגים ותקלות קטנות שאותן נפתור בהקדם האפשרי.\n\n" \
                "נשמח לענות לכל שאלה \בקשה בקבוצה התמיכה, אנו מקווים לראותכם איתנו בקרוב.\n בברכה, צוות הבוט")
        context.bot.send_message(chat_id, text=message)
    sleep(3)
    mainmenu(update,context)
