from lib import deco
import logging
from entries.mainmenu import mainmenu
from time import sleep
logger = logging.getLogger(__name__)

@deco.run_async
@deco.global_callback_handler(pattern='cb_rules')
def rules(update, context):
    chat_id = update.effective_chat.id
    query = update.callback_query
    data = query.data
    if data == "cb_rules":
        message = "כללי שימוש:\n\n" \
                "\U0001F539 מטרת הבוט הינה לספק שרות חינמי, פשוט, יעיל ומהיר לפרסום מוצרים למכירה\מסירה.\n\n" \
                "\U0001F539 כל אחד\אחת רשאים להעלות כמה מודעות שירצו ובלבד שאלו יהיו רק מודעות וידאו.\n\n" \
                "\U0001F539 אנו עובדים בהתנדבות ומפאת זמן ומשאבים נעשה ככל יכולתנו לוודא שהמערכת תעבוד באופן שוטף.\n\n" \
                "\U0001F539 המטרה שלנו הינה ליצור שרותים חינמיים בטלאגרם שיפעלו באופן קהילתי ולא תאגידי. הכל יעבוד בדרך של תרומות ותמיכה של הקהילה בעצמה.\n\n" \
                "\U0001F539 אנו נעשה את כל המאמצים להבטיח שרות פעיל ושוטף ואנו מזמינים אתכם להיות חלק מהקהילה המתפתחת שלנו בטלאגרם.\n\n" \
                "\U0001F539 מודעות שמפורסמות קודם כל עוברות בדיקה לוודא שהן עומדות בנהלים שלנו. מרגע שהמודעה מאושרת היא תופיע במאגר של המודעות. עליכם לוודא שלאחר יצירת המודעה יש לשייך אותה לאחת הקטגוריות מהרשימה.\n\n" \
                "\U0001F539 אנו ממליצים לעבור על הפקודות השונות בכדי להתרגל למערכת. אל תחששו ליצור מודעות וגם למחוק אותן כמה שתרצו על מנת שתלמדו להעלות מודעות יפות ומסודרות.\n\n" \
                "\U0001F539 אנו מאמינים שברגע שתתרגלו לעבוד עם המערכת שלנו לא תכנסו יותר לשום אתר אחר לחפש את המוצר שלכם. הכל יהיה הרבה יותר נגיש מהמובייל, בכל מקום ובכל שעה.\n\n" \
                "\U0001F539 אנו שומרים את הזכות לעדכן את הנהלים מפעם לפעם וכמו כן להוסיף פקודות ושרותים חדשים לבוט. לקבלת תמיכה טכנית או לשאול כל שאלה בנושא תפעול הבוט, אנא השתמשו בקבוצה התמיכה דרך הקישור בתפריט הראשי.\n\n" \
                "\U0001F600 נשמח לראותכם איתנו פועלים יחד למען כולנו."
        context.bot.send_message(chat_id, text=message)
    sleep(3)
    mainmenu(update,context)
